app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    authorize @post
    current_user.posts << @post
---
INSERT INTO "posts" ("author_id", "body", "created_at", "published", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author_id", nil], ["body", "test"], ["created_at", Thu, 20 Mar 2014 20:12:36 UTC +00:00], ["published", nil], ["title", "kk"], ["updated_at", Thu, 20 Mar 2014 20:12:36 UTC +00:00]]

  def update

    authorize @post

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
UPDATE "posts" SET "body" = 'Web Dev. Enjoying Rails!', "updated_at" = '2014-01-28 00:25:53.607827' WHERE "posts"."id" = 2

  def destroy
    authorize @post
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]