app/controllers/projects_controller.rb

INSERT INTO "projects" ("created_at", "name", "technologies_used", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 12 Feb 2014 04:59:39 UTC +00:00], ["name", "test"], ["technologies_used", "kk"], ["updated_at", Wed, 12 Feb 2014 04:59:39 UTC +00:00]]
---
  def create
    @project = Project.new(project_params)
    if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "technologies_used" = 'texf', "updated_at" = '2014-02-12 06:31:52.038440' WHERE "projects"."id" = 1
---
  def update
      @project = Project.find(params[:id])

      if @project.update_attributes(params[:project])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]
---
  def destroy
    @project = Project.find(params[:id])
    if @project.destroy